huddddle/RecruitmentQuestion/mspm0-modules.syscfg
UART2.$name                            = "UART_BT";
UART2.peripheral.rxPin.$assign         = "PA9";
UART2.peripheral.txPin.$assign         = "PA8";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric3";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric4";

UART3.enabledDMARXTriggers              = "DL_UART_DMA_INTERRUPT_RX";
UART3.targetBaudRate                    = 115200;
UART3.$name                             = "UART_Gimbal";
UART3.enabledInterrupts                 = ["RX"];
UART3.peripheral.rxPin.$assign          = "PA25";
UART3.peripheral.txPin.$assign          = "PA26";
UART3.txPinConfig.direction             = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion   = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor  = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric10";
UART3.rxPinConfig.hideOutputInversion   = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor  = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric11";
UART3.DMA_CHANNEL_RX.$name              = "DMA_CH0";
UART3.DMA_CHANNEL_RX.srcLength          = "BYTE";
UART3.DMA_CHANNEL_RX.dstLength          = "BYTE";
UART3.DMA_CHANNEL_RX.peripheral.$assign = "DMA_CH0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Board.peripheral.$suggestSolution                = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution       = "PA20";
Board.peripheral.swdioPin.$suggestSolution       = "PA19";
GPIO1.associatedPins[0].pin.$suggestSolution     = "PB9";
GPIO1.associatedPins[1].pin.$suggestSolution     = "PB8";
GPIO2.associatedPins[0].pin.$suggestSolution     = "PB3";
GPIO2.associatedPins[1].pin.$suggestSolution     = "PB2";
GPIO2.associatedPins[2].pin.$suggestSolution     = "PA7";
GPIO2.associatedPins[3].pin.$suggestSolution     = "PB14";
GPIO3.associatedPins[0].pin.$suggestSolution     = "PB24";
GPIO3.associatedPins[1].pin.$suggestSolution     = "PB20";
GPIO3.associatedPins[2].pin.$suggestSolution     = "PB18";
GPIO3.associatedPins[3].pin.$suggestSolution     = "PB19";
GPIO3.associatedPins[4].pin.$suggestSolution     = "PA12";
GPIO3.associatedPins[6].pin.$suggestSolution     = "PB15";
GPIO3.associatedPins[7].pin.$suggestSolution     = "PA27";
GPIO4.associatedPins[0].pin.$suggestSolution     = "PB10";
GPIO5.associatedPins[0].pin.$suggestSolution     = "PB22";
GPIO7.associatedPins[0].pin.$suggestSolution     = "PB21";
GPIO7.associatedPins[1].pin.$suggestSolution     = "PA14";
GPIO8.associatedPins[0].pin.$suggestSolution     = "PB12";
GPIO8.associatedPins[1].pin.$suggestSolution     = "PB13";
GPIO9.associatedPins[0].pin.$suggestSolution     = "PB17";
PWM3.peripheral.$suggestSolution                 = "TIMG8";
TIMER1.peripheral.$suggestSolution               = "TIMG0";
TIMER2.peripheral.$suggestSolution               = "TIMA0";
UART1.peripheral.$suggestSolution                = "UART0";
UART1.DMA_CHANNEL_RX.peripheral.$suggestSolution = "DMA_CH1";
UART2.peripheral.$suggestSolution                = "UART1";
UART3.peripheral.$suggestSolution                = "UART3";
